#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform


[0m[1mInitializing the backend...[0m

[0m[1mInitializing provider plugins...[0m
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v4.66.1

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/dev/cluster]
data.aws_availability_zones.available: Reading...
module.eks.module.eks_managed_node_group["general"].data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Reading...
module.eks.data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["general"].data.aws_partition.current: Reading...
module.eks.module.kms.data.aws_partition.current: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-085b0c4e7d0b5dbc3]
module.eks.data.aws_caller_identity.current: Reading...
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["general"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["general"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.kms.data.aws_caller_identity.current: Reading...
module.eks.module.kms.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["general"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=dev-cluster-20230510173008572700000002]
module.eks.module.eks_managed_node_group["general"].aws_iam_role.this[0]: Refreshing state... [id=general-eks-node-group-20230510173008564900000001]
module.eks.data.aws_caller_identity.current: Read complete after 1s [id=873345100771]
module.eks.data.aws_iam_session_context.current: Reading...
data.aws_caller_identity.current: Read complete after 1s [id=873345100771]
module.eks.module.eks_managed_node_group["general"].data.aws_caller_identity.current: Read complete after 1s [id=873345100771]
module.eks.module.kms.data.aws_caller_identity.current: Read complete after 1s [id=873345100771]
data.aws_availability_zones.available: Read complete after 1s [id=us-east-1]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0a33afbe89fbfc1b6]
module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:sts::873345100771:assumed-role/ALL_POWER/GitHubActions]
module.eks.module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=general-eks-node-group-20230510173008564900000001-20230510173009394000000005]
module.eks.module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=general-eks-node-group-20230510173008564900000001-20230510173009333300000004]
module.eks.module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=general-eks-node-group-20230510173008564900000001-20230510173009247000000003]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=dev-cluster-20230510173008572700000002-20230510173009546400000007]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=dev-cluster-20230510173008572700000002-20230510173009535400000006]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=737f3ce1-a1cd-44e4-a37d-e9eb2705d12c]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/dev]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::873345100771:policy/dev-cluster-ClusterEncryption2023051017303846000000000b]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=dev-cluster-20230510173008572700000002-2023051017303894240000000c]
aws_ecr_repository.repo: Refreshing state... [id=simple-api-app-images]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-09a54eabd6713081c]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-03bc9ab0cae43cdd2]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0500caf5304b39322]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0c5f4f5dbad2be3be]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-019205e7f2f7f135f]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-07ed5920a0a611dc7]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0ef2f92b082f14837]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0f69c376254e20170]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-07af3262bc05f8416]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0f558202a1bb948c7]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0e726e9760e2b2991]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-06ed2efb2ee8fa25d]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0e726e9760e2b29911080289494]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ca46dd18fe7a5523]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-02c99f30c01179185]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0be2d1f6d4d42d216]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0d5adbf8de0ff6062]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0bdd65403a3b053fc]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-778915440]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-952081492]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-2079323925]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-3310395241]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-202569983]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-525255902]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-708022345]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-158667800]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-2903829765]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2631942075]
Releasing state lock. This may take a few moments...
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0500caf5304b393221080289494]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-723134857]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=dev]
module.eks.time_sleep.this[0]: Refreshing state... [id=2023-05-10T17:40:52Z]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::873345100771:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/DD59E51A1F461BEB5AC0D4E548E7AA63]
module.eks.module.eks_managed_node_group["general"].aws_launch_template.this[0]: Refreshing state... [id=lt-0a9c6ddde4aa32be8]
module.eks.module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Refreshing state... [id=dev:general-2023051017405287430000000f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_iam_group.group will be created
  + resource "aws_iam_group" "group" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "cluster-access"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.aws_cloudwatch_log_group.this[0] must be replaced
+/- resource "aws_cloudwatch_log_group" "this" {
      ~ arn               = "arn:aws:logs:us-east-1:873345100771:log-group:/aws/eks/dev/cluster" -> (known after apply)
      ~ id                = "/aws/eks/dev/cluster" -> (known after apply)
      ~ name              = "/aws/eks/dev/cluster" -> "/aws/eks/dev-cluster/cluster" # forces replacement
      + name_prefix       = (known after apply)
      ~ tags              = {
          ~ "Name" = "/aws/eks/dev/cluster" -> "/aws/eks/dev-cluster/cluster"
        }
      ~ tags_all          = {
          ~ "Name"    = "/aws/eks/dev/cluster" -> "/aws/eks/dev-cluster/cluster"
            # (3 unchanged elements hidden)
        }
        # (2 unchanged attributes hidden)
    }

  # module.eks.aws_eks_cluster.this[0] must be replaced
+/- resource "aws_eks_cluster" "this" {
      ~ arn                       = "arn:aws:eks:us-east-1:873345100771:cluster/dev" -> (known after apply)
      ~ certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvakNDQWVhZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJek1EVXhNREUzTXpZeE9Wb1hEVE16TURVd056RTNNell4T1Zvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTWN1CmxzZVRYOE1OZTZsMy9QblNNUEJ0MWRoUVFoK21UaFpiaDFxNFZ0c1BtSEVTVUdZSUdOeFh2L3lwaHcrSzIyVysKaVNBcnBBanZCdWl0bXk2YStjT3ZiK2JqYXgwc1RxQVBlM0c2dUo5S2s2ZmpRQ2pockdVQmZnQU12M3VyR0dpTAp4OG9QY1hPTys1NTFLLzV2Yld4M1RDWTIrWVRTMUpnK1gwUXBWaWJCSENkOEo3aFpxQk5KVjdrblRVMnFMdHFwCjROWTI4RXlLSXFvSmJORnlxOUFMZEQ4MXRsVlk3WjF4MlhQYndIdC9xWmlIeVZrTTFPRnZscm83T1JHcHZKUXEKUkdiV2gwbFgzRFJ2QjloYTY5R0gyanNCVFFpamxnZTlOMExNVmlXODMrMzlhcFJQN00xZ3pSdWt0cUU3VHNUUApvWnM2OE00bXlxbXpIS1kraDBjQ0F3RUFBYU5aTUZjd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZEUzIyZjdGQ1d5ZlRlN1BuWjhUcjNsVnVsVHJNQlVHQTFVZEVRUU8KTUF5Q0NtdDFZbVZ5Ym1WMFpYTXdEUVlKS29aSWh2Y05BUUVMQlFBRGdnRUJBTVlMbnJOQkNjbUZaZ2hrZWg5SQoydGVNTDZTcXVuSmZmakFXVUpadTEzVS9ZUk1MU1pHMG1BTUFaenFWakNlaGtJMm11QVh1WEpINEtMY1laS0d1CnNhYzJmcnk3ZTA3eXU4ZGdCdEhFTDEvU2NSMVJjTDZUR09XeVo3SjBLYU85MkdZWWFDQVNZeW9jUUVZMG9CVEcKRTFZOGJrMVR4dlNTUE9iS2VFYnRoQVNHUmZIRXE4QkZ6ZUhkRXZlb2dlQS9yNnE3cWNFTHVYNDNkS0FUOEtWSwpoUXN2WWZERGtNb2VDU0lqUldjR2VyakJLVkw0U2hUV3NQSTQ2Wkw2UVYzZlhFQjU4eUd5UTJZQUplbS9DMVZlCjNoaFlXbnFjendEZGh3b2VUTVBJV3pTZWRmaS9lejB1cEQ2NFVEM2NVWnRmR3IwbExiZ3Z2b05yNUw2OUpoZ3gKakEwPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
            },
        ] -> (known after apply)
      + cluster_id                = (known after apply)
      ~ created_at                = "2023-05-10 17:30:39.885 +0000 UTC" -> (known after apply)
      ~ endpoint                  = "https://DD59E51A1F461BEB5AC0D4E548E7AA63.gr7.us-east-1.eks.amazonaws.com" -> (known after apply)
      ~ id                        = "dev" -> (known after apply)
      ~ identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.us-east-1.amazonaws.com/id/DD59E51A1F461BEB5AC0D4E548E7AA63"
                    },
                ]
            },
        ] -> (known after apply)
      ~ name                      = "dev" -> "dev-cluster" # forces replacement
      ~ platform_version          = "eks.2" -> (known after apply)
      ~ role_arn                  = "arn:aws:iam::873345100771:role/dev-cluster-20230510173008572700000002" # forces replacement -> (known after apply) # forces replacement
      ~ status                    = "ACTIVE" -> (known after apply)
      - tags                      = {} -> null
      ~ version                   = "1.26" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ kubernetes_network_config {
          ~ ip_family         = "ipv4" -> (known after apply)
          ~ service_ipv4_cidr = "172.20.0.0/16" -> (known after apply)
          + service_ipv6_cidr = (known after apply)
        }

      ~ vpc_config {
          ~ cluster_security_group_id = "sg-0021e20ed185aa43a" -> (known after apply)
          ~ security_group_ids        = [ # forces replacement
              - "sg-07ed5920a0a611dc7",
            ] -> (known after apply) # forces replacement
          ~ vpc_id                    = "vpc-085b0c4e7d0b5dbc3" -> (known after apply)
            # (4 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] must be replaced
-/+ resource "aws_iam_openid_connect_provider" "oidc_provider" {
      ~ arn             = "arn:aws:iam::873345100771:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/DD59E51A1F461BEB5AC0D4E548E7AA63" -> (known after apply)
      ~ id              = "arn:aws:iam::873345100771:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/DD59E51A1F461BEB5AC0D4E548E7AA63" -> (known after apply)
      ~ tags            = {
          ~ "Name" = "dev-eks-irsa" -> "dev-cluster-eks-irsa"
        }
      ~ tags_all        = {
          ~ "Name"    = "dev-eks-irsa" -> "dev-cluster-eks-irsa"
            # (3 unchanged elements hidden)
        }
      ~ thumbprint_list = [
          - "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
          - "06b25927c42a721631c1efd9431e648fa62e1e39",
          - "2ad974a775f73cbdbbd8f5ac3a49255fa8fb1f8c",
          - "f8e9efef11f4308c0912577ed37afe2707b2721c",
        ] -> (known after apply)
      ~ url             = "oidc.eks.us-east-1.amazonaws.com/id/DD59E51A1F461BEB5AC0D4E548E7AA63" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_iam_policy.cluster_encryption[0] must be replaced
-/+ resource "aws_iam_policy" "cluster_encryption" {
      ~ arn         = "arn:aws:iam::873345100771:policy/dev-cluster-ClusterEncryption2023051017303846000000000b" -> (known after apply)
      ~ id          = "arn:aws:iam::873345100771:policy/dev-cluster-ClusterEncryption2023051017303846000000000b" -> (known after apply)
      ~ name        = "dev-cluster-ClusterEncryption2023051017303846000000000b" -> (known after apply)
      ~ name_prefix = "dev-cluster-ClusterEncryption" -> "dev-cluster-cluster-ClusterEncryption" # forces replacement
      ~ policy_id   = "ANPA4WV3MVPRUJDLWA7P4" -> (known after apply)
      - tags        = {} -> null
        # (4 unchanged attributes hidden)
    }

  # module.eks.aws_iam_role.this[0] must be replaced
+/- resource "aws_iam_role" "this" {
      ~ arn                   = "arn:aws:iam::873345100771:role/dev-cluster-20230510173008572700000002" -> (known after apply)
      ~ create_date           = "2023-05-10T17:30:08Z" -> (known after apply)
      ~ id                    = "dev-cluster-20230510173008572700000002" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::873345100771:policy/dev-cluster-ClusterEncryption2023051017303846000000000b",
          - "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy",
          - "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController",
        ] -> (known after apply)
      ~ name                  = "dev-cluster-20230510173008572700000002" -> (known after apply)
      ~ name_prefix           = "dev-cluster-" -> "dev-cluster-cluster-" # forces replacement
      ~ role_last_used        = [
          - {
              - last_used_date = "2023-05-10T23:47:13Z"
              - region         = "us-east-1"
            },
        ] -> (known after apply)
      - tags                  = {} -> null
      ~ unique_id             = "AROA4WV3MVPRVVVA4RTWS" -> (known after apply)
        # (5 unchanged attributes hidden)

      - inline_policy {
          - name   = "dev-cluster" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Deny"
                          - Resource = "*"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      + inline_policy {
          + name   = "dev-cluster-cluster"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "logs:CreateLogGroup",
                            ]
                          + Effect   = "Deny"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_encryption[0] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "cluster_encryption" {
      ~ id         = "dev-cluster-20230510173008572700000002-2023051017303894240000000c" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::873345100771:policy/dev-cluster-ClusterEncryption2023051017303846000000000b" # forces replacement -> (known after apply) # forces replacement
      ~ role       = "dev-cluster-20230510173008572700000002" # forces replacement -> (known after apply) # forces replacement
    }

  # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"] must be replaced
+/- resource "aws_iam_role_policy_attachment" "this" {
      ~ id         = "dev-cluster-20230510173008572700000002-20230510173009546400000007" -> (known after apply)
      ~ role       = "dev-cluster-20230510173008572700000002" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"] must be replaced
+/- resource "aws_iam_role_policy_attachment" "this" {
      ~ id         = "dev-cluster-20230510173008572700000002-20230510173009535400000006" -> (known after apply)
      ~ role       = "dev-cluster-20230510173008572700000002" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_security_group.cluster[0] must be replaced
+/- resource "aws_security_group" "cluster" {
      ~ arn                    = "arn:aws:ec2:us-east-1:873345100771:security-group/sg-07ed5920a0a611dc7" -> (known after apply)
      ~ egress                 = [] -> (known after apply)
      ~ id                     = "sg-07ed5920a0a611dc7" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Node groups to cluster API"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0ef2f92b082f14837",
                ]
              - self             = false
              - to_port          = 443
            },
        ] -> (known after apply)
      ~ name                   = "dev-cluster-20230510173020614600000008" -> (known after apply)
      ~ name_prefix            = "dev-cluster-" -> "dev-cluster-cluster-" # forces replacement
      ~ owner_id               = "873345100771" -> (known after apply)
      ~ tags                   = {
          ~ "Name" = "dev-cluster" -> "dev-cluster-cluster"
        }
      ~ tags_all               = {
          ~ "Name"    = "dev-cluster" -> "dev-cluster-cluster"
            # (3 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.eks.aws_security_group.node[0] must be replaced
+/- resource "aws_security_group" "node" {
      ~ arn                    = "arn:aws:ec2:us-east-1:873345100771:security-group/sg-0ef2f92b082f14837" -> (known after apply)
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all egress"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ id                     = "sg-0ef2f92b082f14837" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Cluster API to node 4443/tcp webhook"
              - from_port        = 4443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-07ed5920a0a611dc7",
                ]
              - self             = false
              - to_port          = 4443
            },
          - {
              - cidr_blocks      = []
              - description      = "Cluster API to node 6443/tcp webhook"
              - from_port        = 6443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-07ed5920a0a611dc7",
                ]
              - self             = false
              - to_port          = 6443
            },
          - {
              - cidr_blocks      = []
              - description      = "Cluster API to node 8443/tcp webhook"
              - from_port        = 8443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-07ed5920a0a611dc7",
                ]
              - self             = false
              - to_port          = 8443
            },
          - {
              - cidr_blocks      = []
              - description      = "Cluster API to node 9443/tcp webhook"
              - from_port        = 9443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-07ed5920a0a611dc7",
                ]
              - self             = false
              - to_port          = 9443
            },
          - {
              - cidr_blocks      = []
              - description      = "Cluster API to node groups"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-07ed5920a0a611dc7",
                ]
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = []
              - description      = "Cluster API to node kubelets"
              - from_port        = 10250
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-07ed5920a0a611dc7",
                ]
              - self             = false
              - to_port          = 10250
            },
          - {
              - cidr_blocks      = []
              - description      = "Node to node CoreDNS UDP"
              - from_port        = 53
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "udp"
              - security_groups  = []
              - self             = true
              - to_port          = 53
            },
          - {
              - cidr_blocks      = []
              - description      = "Node to node CoreDNS"
              - from_port        = 53
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = true
              - to_port          = 53
            },
          - {
              - cidr_blocks      = []
              - description      = "Node to node ingress on ephemeral ports"
              - from_port        = 1025
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = true
              - to_port          = 65535
            },
        ] -> (known after apply)
      ~ name                   = "dev-node-20230510173021365800000009" -> (known after apply)
      ~ name_prefix            = "dev-node-" -> "dev-cluster-node-" # forces replacement
      ~ owner_id               = "873345100771" -> (known after apply)
      ~ tags                   = {
          ~ "Name"                              = "dev-node" -> "dev-cluster-node"
          - "kubernetes.io/cluster/dev"         = "owned" -> null
          + "kubernetes.io/cluster/dev-cluster" = "owned"
        }
      ~ tags_all               = {
          ~ "Name"                              = "dev-node" -> "dev-cluster-node"
          - "kubernetes.io/cluster/dev"         = "owned" -> null
          + "kubernetes.io/cluster/dev-cluster" = "owned"
            # (3 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.cluster["ingress_nodes_443"] must be replaced
+/- resource "aws_security_group_rule" "cluster" {
      ~ id                       = "sgrule-723134857" -> (known after apply)
      ~ security_group_id        = "sg-07ed5920a0a611dc7" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0dcf572dccf30cf16" -> (known after apply)
      ~ source_security_group_id = "sg-0ef2f92b082f14837" # forces replacement -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["egress_all"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-708022345" -> (known after apply)
      ~ security_group_id        = "sg-0ef2f92b082f14837" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-081e4d8d29f2a2539" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_443"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-2903829765" -> (known after apply)
      ~ security_group_id        = "sg-0ef2f92b082f14837" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-05c010a5f952f8048" -> (known after apply)
      ~ source_security_group_id = "sg-07ed5920a0a611dc7" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-3310395241" -> (known after apply)
      ~ security_group_id        = "sg-0ef2f92b082f14837" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0b9a1ecc33c8dea55" -> (known after apply)
      ~ source_security_group_id = "sg-07ed5920a0a611dc7" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-202569983" -> (known after apply)
      ~ security_group_id        = "sg-0ef2f92b082f14837" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-064ac0147dc247d61" -> (known after apply)
      ~ source_security_group_id = "sg-07ed5920a0a611dc7" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-525255902" -> (known after apply)
      ~ security_group_id        = "sg-0ef2f92b082f14837" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-089a141f3a2111ae1" -> (known after apply)
      ~ source_security_group_id = "sg-07ed5920a0a611dc7" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-2079323925" -> (known after apply)
      ~ security_group_id        = "sg-0ef2f92b082f14837" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0894a82373c9ef2c7" -> (known after apply)
      ~ source_security_group_id = "sg-07ed5920a0a611dc7" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-158667800" -> (known after apply)
      ~ security_group_id        = "sg-0ef2f92b082f14837" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0236894e37c1e02fd" -> (known after apply)
      ~ source_security_group_id = "sg-07ed5920a0a611dc7" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-778915440" -> (known after apply)
      ~ security_group_id        = "sg-0ef2f92b082f14837" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0e729421b58bb453b" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-952081492" -> (known after apply)
      ~ security_group_id        = "sg-0ef2f92b082f14837" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0b01d516d504f5363" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-2631942075" -> (known after apply)
      ~ security_group_id        = "sg-0ef2f92b082f14837" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-042987c8d5c5c8137" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.eks.time_sleep.this[0] must be replaced
+/- resource "time_sleep" "this" {
      ~ id              = "2023-05-10T17:40:52Z" -> (known after apply)
      ~ triggers        = { # forces replacement
          ~ "cluster_certificate_authority_data" = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvakNDQWVhZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJek1EVXhNREUzTXpZeE9Wb1hEVE16TURVd056RTNNell4T1Zvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTWN1CmxzZVRYOE1OZTZsMy9QblNNUEJ0MWRoUVFoK21UaFpiaDFxNFZ0c1BtSEVTVUdZSUdOeFh2L3lwaHcrSzIyVysKaVNBcnBBanZCdWl0bXk2YStjT3ZiK2JqYXgwc1RxQVBlM0c2dUo5S2s2ZmpRQ2pockdVQmZnQU12M3VyR0dpTAp4OG9QY1hPTys1NTFLLzV2Yld4M1RDWTIrWVRTMUpnK1gwUXBWaWJCSENkOEo3aFpxQk5KVjdrblRVMnFMdHFwCjROWTI4RXlLSXFvSmJORnlxOUFMZEQ4MXRsVlk3WjF4MlhQYndIdC9xWmlIeVZrTTFPRnZscm83T1JHcHZKUXEKUkdiV2gwbFgzRFJ2QjloYTY5R0gyanNCVFFpamxnZTlOMExNVmlXODMrMzlhcFJQN00xZ3pSdWt0cUU3VHNUUApvWnM2OE00bXlxbXpIS1kraDBjQ0F3RUFBYU5aTUZjd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZEUzIyZjdGQ1d5ZlRlN1BuWjhUcjNsVnVsVHJNQlVHQTFVZEVRUU8KTUF5Q0NtdDFZbVZ5Ym1WMFpYTXdEUVlKS29aSWh2Y05BUUVMQlFBRGdnRUJBTVlMbnJOQkNjbUZaZ2hrZWg5SQoydGVNTDZTcXVuSmZmakFXVUpadTEzVS9ZUk1MU1pHMG1BTUFaenFWakNlaGtJMm11QVh1WEpINEtMY1laS0d1CnNhYzJmcnk3ZTA3eXU4ZGdCdEhFTDEvU2NSMVJjTDZUR09XeVo3SjBLYU85MkdZWWFDQVNZeW9jUUVZMG9CVEcKRTFZOGJrMVR4dlNTUE9iS2VFYnRoQVNHUmZIRXE4QkZ6ZUhkRXZlb2dlQS9yNnE3cWNFTHVYNDNkS0FUOEtWSwpoUXN2WWZERGtNb2VDU0lqUldjR2VyakJLVkw0U2hUV3NQSTQ2Wkw2UVYzZlhFQjU4eUd5UTJZQUplbS9DMVZlCjNoaFlXbnFjendEZGh3b2VUTVBJV3pTZWRmaS9lejB1cEQ2NFVEM2NVWnRmR3IwbExiZ3Z2b05yNUw2OUpoZ3gKakEwPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==" -> (known after apply)
          ~ "cluster_endpoint"                   = "https://DD59E51A1F461BEB5AC0D4E548E7AA63.gr7.us-east-1.eks.amazonaws.com" -> (known after apply)
          ~ "cluster_name"                       = "dev" -> "dev-cluster"
          ~ "cluster_version"                    = "1.26" -> (known after apply)
        }
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_default_network_acl.this[0] will be updated in-place
  ~ resource "aws_default_network_acl" "this" {
        id                     = "acl-09a54eabd6713081c"
      ~ tags                   = {
          ~ "Name" = "dev-vpc-default" -> "dev-cluster-vpc-default"
        }
      ~ tags_all               = {
          ~ "Name"    = "dev-vpc-default" -> "dev-cluster-vpc-default"
            # (3 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.vpc.aws_default_route_table.default[0] will be updated in-place
  ~ resource "aws_default_route_table" "default" {
        id                     = "rtb-0f558202a1bb948c7"
      ~ tags                   = {
          ~ "Name" = "dev-vpc-default" -> "dev-cluster-vpc-default"
        }
      ~ tags_all               = {
          ~ "Name"    = "dev-vpc-default" -> "dev-cluster-vpc-default"
            # (3 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_default_security_group.this[0] will be updated in-place
  ~ resource "aws_default_security_group" "this" {
        id                     = "sg-03bc9ab0cae43cdd2"
        name                   = "default"
      ~ tags                   = {
          ~ "Name" = "dev-vpc-default" -> "dev-cluster-vpc-default"
        }
      ~ tags_all               = {
          ~ "Name"    = "dev-vpc-default" -> "dev-cluster-vpc-default"
            # (3 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpc.aws_eip.nat[0] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-0a33afbe89fbfc1b6"
      ~ tags                 = {
          ~ "Name" = "dev-vpc-us-east-1a" -> "dev-cluster-vpc-us-east-1a"
        }
      ~ tags_all             = {
          ~ "Name"    = "dev-vpc-us-east-1a" -> "dev-cluster-vpc-us-east-1a"
            # (3 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.vpc.aws_internet_gateway.this[0] will be updated in-place
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-06ed2efb2ee8fa25d"
      ~ tags     = {
          ~ "Name" = "dev-vpc" -> "dev-cluster-vpc"
        }
      ~ tags_all = {
          ~ "Name"    = "dev-vpc" -> "dev-cluster-vpc"
            # (3 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[0] will be updated in-place
  ~ resource "aws_nat_gateway" "this" {
        id                   = "nat-0d5adbf8de0ff6062"
      ~ tags                 = {
          ~ "Name" = "dev-vpc-us-east-1a" -> "dev-cluster-vpc-us-east-1a"
        }
      ~ tags_all             = {
          ~ "Name"    = "dev-vpc-us-east-1a" -> "dev-cluster-vpc-us-east-1a"
            # (3 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0500caf5304b39322"
      ~ tags             = {
          ~ "Name" = "dev-vpc-private" -> "dev-cluster-vpc-private"
        }
      ~ tags_all         = {
          ~ "Name"    = "dev-vpc-private" -> "dev-cluster-vpc-private"
            # (3 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-0e726e9760e2b2991"
      ~ tags             = {
          ~ "Name" = "dev-vpc-public" -> "dev-cluster-vpc-public"
        }
      ~ tags_all         = {
          ~ "Name"    = "dev-vpc-public" -> "dev-cluster-vpc-public"
            # (3 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[0] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0c5f4f5dbad2be3be"
      ~ tags                                           = {
          ~ "Name" = "dev-vpc-private-us-east-1a" -> "dev-cluster-vpc-private-us-east-1a"
        }
      ~ tags_all                                       = {
          ~ "Name"    = "dev-vpc-private-us-east-1a" -> "dev-cluster-vpc-private-us-east-1a"
            # (3 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[1] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-019205e7f2f7f135f"
      ~ tags                                           = {
          ~ "Name" = "dev-vpc-private-us-east-1b" -> "dev-cluster-vpc-private-us-east-1b"
        }
      ~ tags_all                                       = {
          ~ "Name"    = "dev-vpc-private-us-east-1b" -> "dev-cluster-vpc-private-us-east-1b"
            # (3 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-07af3262bc05f8416"
      ~ tags                                           = {
          ~ "Name" = "dev-vpc-public-us-east-1a" -> "dev-cluster-vpc-public-us-east-1a"
        }
      ~ tags_all                                       = {
          ~ "Name"    = "dev-vpc-public-us-east-1a" -> "dev-cluster-vpc-public-us-east-1a"
            # (3 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[1] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-0f69c376254e20170"
      ~ tags                                           = {
          ~ "Name" = "dev-vpc-public-us-east-1b" -> "dev-cluster-vpc-public-us-east-1b"
        }
      ~ tags_all                                       = {
          ~ "Name"    = "dev-vpc-public-us-east-1b" -> "dev-cluster-vpc-public-us-east-1b"
            # (3 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
        id                                   = "vpc-085b0c4e7d0b5dbc3"
      ~ tags                                 = {
          ~ "Name" = "dev-vpc" -> "dev-cluster-vpc"
        }
      ~ tags_all                             = {
          ~ "Name"    = "dev-vpc" -> "dev-cluster-vpc"
            # (3 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)
    }

  # module.eks.module.eks_managed_node_group["general"].aws_eks_node_group.this[0] must be replaced
+/- resource "aws_eks_node_group" "this" {
      ~ ami_type               = "AL2_x86_64" -> (known after apply)
      ~ arn                    = "arn:aws:eks:us-east-1:873345100771:nodegroup/dev/general-2023051017405287430000000f/5ac40360-342a-f8d4-b301-a237e38b3da8" -> (known after apply)
      ~ capacity_type          = "ON_DEMAND" -> (known after apply)
      ~ cluster_name           = "dev" -> "dev-cluster" # forces replacement
      ~ disk_size              = 0 -> (known after apply)
      ~ id                     = "dev:general-2023051017405287430000000f" -> (known after apply)
      ~ instance_types         = [
          - "t3.medium",
        ] -> (known after apply)
      - labels                 = {} -> null
      ~ node_group_name        = "general-2023051017405287430000000f" -> (known after apply)
      ~ release_version        = "1.26.2-20230501" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-general-2023051017405287430000000f-5ac40360-342a-f8d4-b301-a237e38b3da8"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> (known after apply)
      ~ status                 = "ACTIVE" -> (known after apply)
        tags                   = {
            "Name" = "general"
        }
      ~ version                = "1.26" -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-0a9c6ddde4aa32be8"
          ~ name    = "general-2023051017405226410000000d" -> (known after apply)
          ~ version = "1" -> (known after apply)
        }

      ~ update_config {
          - max_unavailable            = 0 -> null
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.eks.module.eks_managed_node_group["general"].aws_launch_template.this[0] will be updated in-place
  ~ resource "aws_launch_template" "this" {
      ~ default_version         = 1 -> (known after apply)
        id                      = "lt-0a9c6ddde4aa32be8"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "general-2023051017405226410000000d"
        tags                    = {}
      ~ vpc_security_group_ids  = [
          - "sg-0ef2f92b082f14837",
        ] -> (known after apply)
        # (8 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.eks.module.kms.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
      + id                        = (known after apply)
      + json                      = (known after apply)
      + override_policy_documents = []
      + source_policy_documents   = []

      + statement {
          + actions   = [
              + "kms:CancelKeyDeletion",
              + "kms:Create*",
              + "kms:Delete*",
              + "kms:Describe*",
              + "kms:Disable*",
              + "kms:Enable*",
              + "kms:Get*",
              + "kms:List*",
              + "kms:Put*",
              + "kms:Revoke*",
              + "kms:ScheduleKeyDeletion",
              + "kms:TagResource",
              + "kms:UntagResource",
              + "kms:Update*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "KeyAdministration"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::873345100771:role/ALL_POWER",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:DescribeKey",
              + "kms:Encrypt",
              + "kms:GenerateDataKey*",
              + "kms:ReEncrypt*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "KeyUsage"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.eks.module.kms.aws_kms_alias.this["cluster"] must be replaced
-/+ resource "aws_kms_alias" "this" {
      ~ arn            = "arn:aws:kms:us-east-1:873345100771:alias/eks/dev" -> (known after apply)
      ~ id             = "alias/eks/dev" -> (known after apply)
      ~ name           = "alias/eks/dev" -> "alias/eks/dev-cluster" # forces replacement
      + name_prefix    = (known after apply)
      ~ target_key_arn = "arn:aws:kms:us-east-1:873345100771:key/737f3ce1-a1cd-44e4-a37d-e9eb2705d12c" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.eks.module.kms.aws_kms_key.this[0] will be updated in-place
  ~ resource "aws_kms_key" "this" {
      ~ description                        = "dev cluster encryption key" -> "dev-cluster cluster encryption key"
        id                                 = "737f3ce1-a1cd-44e4-a37d-e9eb2705d12c"
      ~ policy                             = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "kms:Update*",
                          - "kms:UntagResource",
                          - "kms:TagResource",
                          - "kms:ScheduleKeyDeletion",
                          - "kms:Revoke*",
                          - "kms:Put*",
                          - "kms:List*",
                          - "kms:Get*",
                          - "kms:Enable*",
                          - "kms:Disable*",
                          - "kms:Describe*",
                          - "kms:Delete*",
                          - "kms:Create*",
                          - "kms:CancelKeyDeletion",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::873345100771:role/ALL_POWER"
                        }
                      - Resource  = "*"
                      - Sid       = "KeyAdministration"
                    },
                  - {
                      - Action    = [
                          - "kms:ReEncrypt*",
                          - "kms:GenerateDataKey*",
                          - "kms:Encrypt",
                          - "kms:DescribeKey",
                          - "kms:Decrypt",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::873345100771:role/dev-cluster-20230510173008572700000002"
                        }
                      - Resource  = "*"
                      - Sid       = "KeyUsage"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags                               = {}
        # (9 unchanged attributes hidden)
    }

Plan: 25 to add, 15 to change, 24 to destroy.

Changes to Outputs:
  ~ cluster_name = "dev" -> "dev-cluster"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @jumana-s, Action: `pull_request`*